[{"id":0,"title":"Cy and Den Test","author":"Mitsuki Youko","date_created":"2025-03-06","tag":"cyandden","blurb":"Testing Cy and Den tag","content":"\nPretend this is a Cy and Den infographic.. this is how the images would display AKA at full width vs the other technical writing-esque pics which display at a resonably smaller size.\n\n![testimage](assets/content/Blogpost1/img/1.png)\n\n<!-- test -->\n\n![test](assets/content/Blogpost1/img/2.jpg)","folderName":"Blogpost1"},{"id":1,"title":"Projectssss","author":"Mitsuki Youko","date_created":"2025-04-06","tag":"projects","blurb":"blurb for the second post","content":"\n# Heading 1\n\n### Heading 3\n\nParagraph goes here...\n\nImage goes here:\n\n<test what its like to put an image here..>\n\n![testimage2](assets/content/Blogpost2/img/1.jpg)","folderName":"Blogpost2"},{"id":2,"title":"Introducing Cy and Den","author":"Mitsuki Youko","date_created":"2025-03-27","tag":"misc","blurb":"Introducing Cyanscythe and Goldenmage","content":"\n### What is / Who are CyanScythe (Cy) and GoldenMage (Den)?\n\nI love drawing and creating characters and figured... Why not mash that and what I learn in Ethical Hacking together?\nThat gave me the idea of drawing infographics whenever I learned something that could be infographic-worthy.\n \nSince I needed a name for my blog I just randomly came up with the word CyanScythe and created a character based off of that which I thought would be cool as an attacker type character. Then I thought \"Well attacker = red team.. so I'll need a \"defender\" and so I created GoldenMage.\n​\nIssue was that their color schemes were that of the opposing team.. but CyanScythe was such a cool name that I decided to make it so that she has magenta eyes and when she \"attacks\" with her scythe, it will turn red - thus giving her a red team vibe, despite the fact that her color scheme was cyan.\n \nDesign-wise, GoldenMage was a bit easier though I originally imagined his color scheme to be red and gold but since he is on the blue team, I gave him blue accessories. His powers are also blue to give off the blue team vibe.\n​\nNot only that, but a good theme here is that their designs can represent how important it is for red teamers to learn how to defend against cyber attacks and blue teamers to learn how attackers would attack, forming a good purple team - since they have colors of the opposing team.\n​\nIn the CyanScythe and GoldenMage Infographics, Cy will be presenting things from a Red Team Perspective while Den will be presenting things from a Blue Team Perspective.\n\nYou may also see a few comics about the both of them, if I happen to have a topic that can effectively be told in comic format.\n\nHope you enjoy the blog!\n\n---\n\n#### Cy's Character and Weapon Designs:\n\nWhen in Neutral mode, Cy's scythe is blue but it turns red when she is attacking.\n\n![Cy Neutral Mode](assets/content/IntroCyAndDen/img/Cy%20Neutral%20Mode.jpg)\n![Cy Attacker Mode](assets/content/IntroCyAndDen/img/Cy%20Attacker%20Mode.jpg)\n\n#### Den's Character and Weapons Design:\n\nDen's Barriers are not just for defensive purposes - he can use them to attack as well!\n\n![Den](assets/content/IntroCyAndDen/img/Den.jpg)\n![Den Weapon Design](assets/content/IntroCyAndDen/img/Den%20Weapons%20Design.png)\n","folderName":"IntroCyAndDen"},{"id":3,"title":"Running Dog Animation Critique","author":"Mitsuki Youko","date_created":"2025-04-03","tag":"misc","blurb":"Running Dog Anim Critique for u/remyisacutie","content":"\n# (WIP)\n\n### Overview\n\nThis blogpost is a bit different than my others as I will be breaking down my animation and composting process for [this reddit post](https://www.reddit.com/r/animation/comments/1jqdx7c/ik_this_is_wrong_but_how_do_i_fix_it/).\n\nHere is u/remyisacutie's original animation:\n\n![runningdog](assets/content/RunningDog/img/runningdog.mp4)\n\nHere are my initial thoughts on it:\n\n1. Dog's eyes are too static, introduce some blink\n2. belly flops around a bit toooo much.. its like his ribs are moving - seems slightly unnatural.. if he just has a fat belly, the flop should be lower. (imo)\n3. legs are good but not quite on the ground\n4. no shadow\n5. cloud moving in different directions.. i guess that kinda works but if there's wind thats impacting the clouds that much, the trees would be affected a little too..\n6. ears, tail, and legs are actually quite good!\n7. tongue looks like its being swung forward.. doesn't quite match the running direction i feel...\n8. Tail is decent but it gets a little bit longer near the end.. (i struggle with that sometimes when i animate hair XD)\n9. Weight looks like it is on all 4 legs at the same time... i feel that when landing, weight should be on the front legs... this can probs be fixed simply by transforming and tilting the whole dog snout-side down just a tiny bit...\n10. neck wrinkles are good but slightly off on timing it feels like..\n11. looks like the path/ground is going z-axis yet the dog is running x axis which looks a bit.. strange i guess? but that might just be the placement cuz its not moving.. if the floor is moving, it would sell the thing a bit more...\n12. imo the reason why it doesn't loop well is cus you probs need one more frame for some of the poses like the jump between the last and first frame is too big.\n13. lighting.. the lighting changes too quickly on the dog like its running past a spotlight.. if its sunlight because its so far away, it wouldn't move on the dog that fast.\n14. camera movement (maybe when landing, camera should follow the land a little - not TOO drastically but just a little movement helps)\n15. when looping always think back to HOW it loops. do sketches first to see if it loops properly.. (before coloring or linearting) one trick is on the second half of the loop, use the frames in the first half in reversed order, then change some stuff in each so it doesn't just look like a copy\n\n---\n\n### Small Project Break Down..\n\n#### Animation Layers:\n1. Dog\n2. Shadow\n3. Foreground (ground and trees)\n    1. Make the ground long so that it you can move it x-axis. \n4. Background (clouds)\n5. Sky\n\n#### My Workflow for this critique demo:\n1. Sketch the dog running\n2. Sketch the dog's shadow\n3. Sketch the long bg on a different document. if animating, then composite it later. \n4. Lineart the bg\n5. Color the bg\n6. Lineart the dog\n7. Color the dog\n8. Color the Shadow\n9. Composite (Either baked in or after export.)\n\n#### I'll be making Two versions:\n1. Dog running with animated bg (BAKED IN Compositing)\n2. Dog running with animated bg (Compositing after Exporting)\n\n#### Composting tips:\n1. Export EACH animation layer separately so as to be able to add effects to them.. by layers I don't mean the dog's legs being on a different layer than its eyes... I mean Dog and its sublayers get exported as 1 png animation, bg gets exported as its own animation etc.. Anything you need to composite separately gets exported as its own png gif or image sequence.\n\n---\n\n### DEMO\n\nSo First thing's first.. gotta lay down the rough sketch of the dog model since its so long since I've drawn a dog.. (Had to rewatch the animal anatomy part of Marc Brunet's Digital Art School course that I bought a few years ago XD)\n\n![runningdogmodel](assets/content/RunningDog/img/Runningdogmodel.jpg)\n\nI used the straight line tool in CSP to make the line for the floor.\n\nThis is to make sure that when animating, the dog's paws won't go too high above or too low below the \"floor\". ideally it should land right on the line or as close to it as possible.\n\nI sketched the dog model just for reference and so I can make sure the animation stays on character.\n\nNow, so far drew a box around the dog so i can roughly tell where things are going to be placed...\n\n![dog-rectangle](assets/content/RunningDog/img/dog-rectangle.jpg)\n\nAnd then I animated the box to get the movement down..\n\n![blockout.gif](assets/content/RunningDog/img/blockout.gif)\n\n![roughplacement](assets/content/RunningDog/img/roughplacement.jpg)\n\nAs you can see, the frames are evenly spread out.. not very dynamic is it..?\n\nDon't worry, I will adjust the timing now after the rough movement has been placed..\n\nHere, I tend to play around - extend some frames, shorten others.. some people animate on 2's, 3's, 4's... that's way too much math for me loooll\n\nI animate based on feel.. so if you want to animate industry level stuff you might have to study how to animate on 2's etc. or whatever the industry uses :P\n\nI'm just a hobbyist and if it looks good to me, well that's really all I need XD\n\nSo after some re-timing, the frames now look like this:\n\n![frames_updated](assets/content/RunningDog/img/frames_updated.jpg)\n\nI also slightly adjusted the position and rotation of a few of the rectangles for a smoother flow..\n\n![blockout_framed](assets/content/RunningDog/img/blockout_framed.gif)\n\nSo the next phase of my rough sketch is going to be to move the bg around..\n\n[Watch this excellent video on how to use Keyframes for Camera Movement in CSP](https://www.youtube.com/watch?v=8F9eJjDkvtE)\n\nIf you don't use CSP, you can try to see if the software you use supports camera movements.\n\nOtherwise, if you want to do your camera movements during compositing instead, make sure you make the canvas size like roughly 0.5-1 inches bigger so that when compositing, your bg won't get awkwardly cut off when you reach the edge of the canvas.\n\nHere, I have the background animation folders within a larger folder and applied the keyframes to said folder.\n\nThe rectangle \"dog\" was outside the \"camera\" folder so as to not be affected by the camera keyframes.\n\nBackground camera keyframed to ever-so-slightly move up and down upon impact.\n\n![camera_keyframe](assets/content/RunningDog/img/camerakeyframe.jpg)\n\n![camera_keyframe_gif](assets/content/RunningDog/img/camera-keyframe.gif)\n\nThis is suuuuuper rough (bg timing is not very good either and should be fixed..).. Let's make this better and start sketching the dog :D\n\n![doglayer](assets/content/RunningDog/img/doglayer.jpg)\n\nImma start with the head..\n\n![dogheadske](assets/content/RunningDog/img/dogheadske.gif)\n\nWhen the dog lands, it'll crouch a bit so the head will be lower than it is now on those frames but for now, lets get the general movement down before worrying about that.\n\nAdding the neck guidelines / sketch:\n\n![dogheadneck](assets/content/RunningDog/img/dogheadneck.gif)\n\nAdding the body (mainly rib placement atm)\n\n![dogheadneckbod](assets/content/RunningDog/img/dogheadneckbod.gif)\n\nAdding the tail.. this one was a bit complicated.. had to fiddle with it for a bit..\n\n![dogtail](assets/content/RunningDog/img/dogtail.gif)\n\nOMG.. dogs are hard to draw lmaooo (not rly I just need more practice to get good at it XD)\n\nLooked up a dog running gif on the internet for some reference..\n\nOk.. I think Imma just stylize the legs instead of making them look realistic.. maybe gonna give him \"hoof-like\" legs instead cuz I'm too lazy to learn how to draw a dog just for a critique XD\n\n![doglegz](assets/content/RunningDog/img/doglegz.gif)\n\nAight, added the ears and snout..\n\n![runningdogskebgless](assets/content/RunningDog/img/runningdogskebgless.gif)\n\n\nChecking how it looks with the bg:\n\n![runningdogfullske](assets/content/RunningDog/img/runningdogfullske.gif)\n\nPretty good so far..\n\nI decided that it would be easier to just draw the dog lineart on a different animation layer than the sketch just in case I add more in betweens so made another layer for lineart.\n\n![dognewlayer](assets/content/RunningDog/img/dognewlayer.jpg)\n\nI will most likely color in the same animation layer (not same layer as the lineart but think of EACH frame in the animation layer as a folder and within that folder there are many more layers like lineart, color, etc.)\n\nSwitching gears, I decided to work on the background and created a new 1920 x 1080 CSP file. I then changed the canvas size so as to make it super long horizontally so as to make a revolving background. remember that the rightmost and leftmost section of your bg would need to be \"connectable\" with each other to sell that continuous effect when looping.\n\nI also expanded the canvas slightly vertically so as to maintain enough space for the camera's slight vertical pan when the dog jumps.\n\n![bgdoc](assets/content/RunningDog/img/bgdoc.jpg)\n\nI started with the clouds. \n\n![cloudline](assets/content/RunningDog/img/cloudline.jpg)\n\nI don't think there is wind strong enough to really make the clouds move drastically in any direction without it blowing the dog away (Clouds usually move rather slowly.. so unless the camera is focused on the clouds, you probs won't see it move much if at all.) so I'll keep the clouds static and have it wrap around in a revolving loop later.\n\n![cloudske](assets/content/RunningDog/img/cloudske.jpg)\n\nWhat I mean by revolve is if you take the right and leftmost cloud and you put them together, they should line up perfectly...\n\n![cloudwrap](assets/content/RunningDog/img/cloudwrap.jpg)\n\nThis is so that when you pan, you start with lining up the right side of this image to the right edge of the dog anim, and then you pan it by dragging it to the right slowly and smoothly. By the time it reaches the right side, there is no more art to continue it, you wrap it around and keyframe the image from its starting position coming in from the left..\n\nIt'll probably make more sense to see it in action... (Keep in mind this is still quite rough... but it gets the point across..)\n\nHere's the vid on youtube as the raw vid is too big for me to host on github unfortunately: [https://youtu.be/Z0TCPKRYMY8](https://youtu.be/Z0TCPKRYMY8).\n\n<!--  \n\nNote to self:\n- animate the grass slowly blowing in the wind\n- animate the shadow under the dog\n- assemble the bg in the dog running file\n- \n\n-->\n\n\n<!-- \n\nnpm run server\nnpm run build\ngit add .\ngit commit -m \"update note\"\ngit push -u origin\nnpm run deploy \n\n-->\n","folderName":"RunningDog"}]