[{"id":0,"title":"Technical Writing testing","author":"Mitsuki Youko","date_created":"2025-03-06","tag":"techwriting","blurb":"blurb for the first post","content":"\n# Heading 1\n\n### Heading 3\n\nParagraph goes here...\n\nImage goes here:\n\n<test what its like to put an image here..>\n\n![testimage](/src/content/Blogpost1/img/1.png)","folderName":"Blogpost1"},{"id":1,"title":"Projectssss","author":"Mitsuki Youko","date_created":"2025-04-06","tag":"projects","blurb":"blurb for the second post","content":"\n# Heading 1\n\n### Heading 3\n\nParagraph goes here...\n\nImage goes here:\n\n<test what its like to put an image here..>\n\n![testimage2](/src/content/Blogpost2/img/1.jpg)","folderName":"Blogpost2"},{"id":2,"title":"Introducing Cy and Den","author":"Mitsuki Youko","date_created":"2025-03-27","tag":"cyandden","blurb":"No Blurb Available","content":"\n### What is / Who are CyanScythe (Cy) and GoldenMage (Den)?\n\nI love drawing and creating characters and figured... Why not mash that and what I learn in Ethical Hacking together?\nThat gave me the idea of drawing infographics whenever I learned something that could be infographic-worthy.\n \nSince I needed a name for my blog I just randomly came up with the word CyanScythe and created a character based off of that which I thought would be cool as an attacker type character. Then I thought \"Well attacker = red team.. so I'll need a \"defender\" and so I created GoldenMage.\n​\nIssue was that their color schemes were that of the opposing team.. but CyanScythe was such a cool name that I decided to make it so that she has magenta eyes and when she \"attacks\" with her scythe, it will turn red - thus giving her a red team vibe, despite the fact that her color scheme was cyan.\n \nDesign-wise, GoldenMage was a bit easier though I originally imagined his color scheme to be red and gold but since he is on the blue team, I gave him blue accessories. His powers are also blue to give off the blue team vibe.\n​\nNot only that, but a good theme here is that their designs can represent how important it is for red teamers to learn how to defend against cyber attacks and blue teamers to learn how attackers would attack, forming a good purple team - since they have colors of the opposing team.\n​\nIn the CyanScythe and GoldenMage Infographics, Cy will be presenting things from a Red Team Perspective while Den will be presenting things from a Blue Team Perspective.\n\nYou may also see a few comics about the both of them, if I happen to have a topic that can effectively be told in comic format.\n\nHope you enjoy the blog!\n\n---\n\n#### Cy's Character and Weapon Designs:\n\nWhen in Neutral mode, Cy's scythe is blue but it turns red when she is attacking.\n\n![Cy Neutral Mode](/src/content/IntroCyAndDen/img/Cy%20Neutral%20Mode.jpg)\n![Cy Attacker Mode](/src/content/IntroCyAndDen/img/Cy%20Attacker%20Mode.jpg)\n\n#### Den's Character and Weapons Design:\n\nDen's Barriers are not just for defensive purposes - he can use them to attack as well!\n\n![Den](/src/content/IntroCyAndDen/img/Den.jpg)\n![Den Weapon Design](/src/content/IntroCyAndDen/img/Den%20Weapons%20Design.png)\n","folderName":"IntroCyAndDen"}]